#Варінт 1
s = int(input("Введіть будь ласка ціле число :"))
a = s // 10000
b = s % 10000 // 1000
c = s % 1000 // 100
d = s % 100 // 10
e = s % 10
print(e, d, c, b, a, sep="")

#Варіант 2
n = int(input("Введіть будь ласка ціле число :"))
print(n % 10,n % 100 // 10,n % 1000 // 100,n % 10000 // 1000,n // 10000,sep="")

#Варіант 3.
a = int(input("Введіть будь ласка ціле число :"))
b = 0
while a > 0:
    digit = a % 10
    a = a // 10

    b = b * 10
    b = b + digit
print("Bаріант 3-й","Зворотнє число :" , b)