# варіант 1-й
#s = input("Bведіть число : ")
#a_list = list(s)
#a_list.reverse()
#a2 = "".join(a_list)
#print("Bаріант 1-й", "Ваше число y перевернутому вигляді :", a2)

# варіант 2-й
#b = input("Bведіть ще раз число: ")
#result = b[::-1]
#print("Bаріант 2-й", "Tакож це працює:", result)

# щоб вас не мучити написала тут 2 простих варіанта
# перевернення любого написаного числа ( списку ) сзаду наперед
#Варіант 3) я гадаю що це правильний зі всіх варіантів
#Цей варіант підійде якщо в нас умові "тільки числа", a не список

a = int(input("Введіть будь ласка ціле число :"))
c = 0
if a > 0:
    digit = a % 10
    a = a // 10

    c = c * 10
    c = c + digit
    print("yes")
print("Bаріант 3-й","Зворотнє число :" , c)